// useParams (react-router-dom) - Хук дает доступ к параметрам поиска в URL

// reselect - библиотека, в которой есть функция createSelector - они принимает массив selector`ов и функцию преобразования,

// если значения входных селекторов такие же как и в предыдущем вызове селектора, он вернёт ранее вычисленное значение, вместо того чтобы вызывать функцию преобразования.

// Интерпретатор бежит по коду 

// react - setState, если несколько - они схлоповаются в один и происходит только один ререндер

// разница inline и inline-block в поддержке стилей:
// inline только:     margin-left , margin-right , padding-left , padding-right
// inline-block:      margin , padding , height, width

// отличия style component от modules:
// style-component можно прокидывать пропсы, css modules меняет название классов для инкапсуляции. по разному загружаются стили на странице.

// event loop === цикл событий

// e.stopPropagation() - убирает всплытие, например при клике на двух интерактивных элемента
// e.preventDefault() отмена действия браузера по умолчанию  --- отменяет загрузку страницы по ссылке. Когда надо провести валидацию, чтобы не отправлять форму сразу.